In [198]:
import pandas as pd
import numpy as np

In [199]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [200]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

**1)Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column).**

In [201]:
df['FlightNumber'] = df['FlightNumber'].interpolate().astype(int)
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

**2)The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.**

In [202]:
df['From'] = df.From_To.str.split('_').str[0]
df['To'] = df.From_To.str.split('_').str[1]
df

            From_To  FlightNumber  ...      From         To
0      LoNDon_paris         10045  ...    LoNDon      paris
1      MAdrid_miLAN         10055  ...    MAdrid      miLAN
2  londON_StockhOlm         10065  ...    londON  StockhOlm
3    Budapest_PaRis         10075  ...  Budapest      PaRis
4   Brussels_londOn         10085  ...  Brussels     londOn

[5 rows x 6 columns]

**3)Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)**

In [203]:
df['From'] = df['From'].str.lower().str.capitalize()
df['To'] = df['To'].str.lower().str.capitalize()
df

            From_To  FlightNumber  ...      From         To
0      LoNDon_paris         10045  ...    London      Paris
1      MAdrid_miLAN         10055  ...    Madrid      Milan
2  londON_StockhOlm         10065  ...    London  Stockholm
3    Budapest_PaRis         10075  ...  Budapest      Paris
4   Brussels_londOn         10085  ...  Brussels     London

[5 rows x 6 columns]

**4)delete the From_To column from df and attach the temporary DataFrame
from the previous questions.**

In [204]:
df.drop(labels='From_To', axis = 1,inplace= True)
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

**5)In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each
second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.
Expand the Series of**

In [205]:
new = pd.DataFrame(df['RecentDelays'].tolist(),columns=['delay_1','delay_2','delay_3'])
df.insert(2,"Delay_1",new['delay_1'])
df.insert(3,"Delay_2",new['delay_2'])
df.insert(4,"Delay_3",new['delay_3'])
df.drop(labels="RecentDelays",axis=1,inplace= True)
df

   FlightNumber  Delay_1  Delay_2  ...              Airline      From         To
0         10045     23.0     47.0  ...               KLM(!)    London      Paris
1         10055      NaN      NaN  ...    <Air France> (12)    Madrid      Milan
2         10065     24.0     43.0  ...  (British Airways. )    London  Stockholm
3         10075     13.0      NaN  ...       12. Air France  Budapest      Paris
4         10085     67.0     32.0  ...          "Swiss Air"  Brussels     London

[5 rows x 7 columns]

In [206]:
df['Airline']=df['Airline'].str.extract(r'([a-zA-Z]+\s[a-zA-Z]+|[a-zA-Z]+)')
df

   FlightNumber  Delay_1  Delay_2  ...          Airline      From         To
0         10045     23.0     47.0  ...              KLM    London      Paris
1         10055      NaN      NaN  ...       Air France    Madrid      Milan
2         10065     24.0     43.0  ...  British Airways    London  Stockholm
3         10075     13.0      NaN  ...       Air France  Budapest      Paris
4         10085     67.0     32.0  ...        Swiss Air  Brussels     London

[5 rows x 7 columns]